<!-- dflook/terraform-github-actions {"workspace":"default","backend":"a87e56c90277389c602a4ffc6c830b0b7c01faeabe6c2ffeb0bc3c9313be9295","backend_type":"s3","plan_job_ref":"Job terraform-plan-05-aws-complete #17 at https://github.com/pipetail/terraform/actions/runs/3512843038","plan_hash":"8853a21c1d19345c13ae8cb5e280a6833f5c550441f13af60b90aa1ae387a98f","plan_text_format":"text"} -->
Terraform plan in __examples/05-aws-complete__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_replication_group.redis will be created
  + resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "redis cluster"
      + engine                         = "redis"
      + engine_version                 = "6.2"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.t4g.small"
      + num_cache_clusters             = 2
      + num_node_groups                = (known after apply)
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = "redis6-x"
      + port                           = 6379
      + preferred_cache_cluster_azs    = [
          + "eu-west-1a",
          + "eu-west-1b",
        ]
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_description  = (known after apply)
      + replication_group_id           = "*************"
      + security_group_ids             = [
          + "sg-05845cea175649316",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "complete-example-main-vpc"
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = (known after apply)

      + cluster_mode {
          + num_node_groups         = (known after apply)
          + replicas_per_node_group = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-05-aws-complete #17](https://github.com/pipetail/terraform/actions/runs/3512843038)